<template>
  <div>
    <a-drawer :push="{distance:80}" v-model:open="openDrawer" :bodyStyle="{ padding: '0', background: '#f7f7fd' }" :closable="false"
      width="1165px" placement="right">
      <!-- 自定义头部 -->
      <template #title>
        <div class="custom-header flex justify-between h-4 flex-items-center">
          <div class="text-5">学员详情</div>
          <a-button type="text" @click="openDrawer = false" class="close-btn">
            <template #icon>
              <CloseOutlined class="text-5 close-icon" />
            </template>
          </a-button>
        </div>
      </template>
      <div class="contenter flex flex-center bg-white px6 py3">
        <div class="avatarBox w-16 h-16 relative">
          <img width="64" height="64" class=" rounded-100"
            src="https://cdn.schoolpal.cn/schoolpal/next-erp/avator_female.png?x-oss-process=image/resize,w_192" alt="">
          <svg width="24px" height="24px" viewBox="0 0 24 24" style="position: absolute; bottom: 0px; right: 0px;">
            <g id="\u9875\u9762-2" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
              <g id="\u753B\u677F\u5907\u4EFD-24" transform="translate(-1529.000000, -266.000000)">
                <g id="\u7F16\u7EC4" transform="translate(1529.000000, 266.000000)">
                  <g id="\u7537" fill="#FF3333">
                    <circle id="\u692D\u5706\u5F62" cx="12" cy="12" r="12"></circle>
                  </g>
                  <g transform="translate(4.000000, 3.722662)" fill="#FFFFFF" id="\u65B0/\u7B26\u53F7/\u5973\u751F">
                    <path
                      d="M14.0392198,1.98464807 C14.3104172,2.25584549 14.3104172,2.6955434 14.0392198,2.96674082 L12.7581282,4.24782197 L13.8356011,5.32529291 C14.1067985,5.59649034 14.1067985,6.03618824 13.8356011,6.30738566 C13.5644037,6.57858309 13.1247058,6.57858309 12.8535084,6.30738566 L11.7760417,5.22990846 L11.0422043,5.9637881 C11.6729795,6.80471314 12.0529934,7.84453862 12.0712783,8.97229681 L12.0719697,9.05764313 C12.0719697,11.9079764 9.76131807,14.218628 6.91098485,14.218628 C4.06065162,14.218628 1.75,11.9079764 1.75,9.05764313 C1.75,6.20730991 4.06065162,3.89665829 6.91098485,3.89665829 C8.09991052,3.89665829 9.19493833,4.29868287 10.067543,4.9742068 L10.7939552,4.24782197 L9.9295504,3.3834277 C9.65835297,3.11223027 9.65835297,2.67253237 9.9295504,2.40133495 C10.2007478,2.13013752 10.6404457,2.13013752 10.9116432,2.40133495 L11.7760417,3.26573548 L13.0571271,1.98464807 C13.3283245,1.71345064 13.7680224,1.71345064 14.0392198,1.98464807 Z M6.91098485,5.28554717 C4.82771378,5.28554717 3.13888889,6.97437206 3.13888889,9.05764313 C3.13888889,11.1409142 4.82771378,12.8297391 6.91098485,12.8297391 C8.97342321,12.8297391 10.6492649,11.1745218 10.6825755,9.12002164 L10.6830492,9.06119427 L10.6824968,8.99148152 L10.6821047,8.97066975 C10.664377,8.18243978 10.4051064,7.43717494 9.94528363,6.81616198 L9.93114482,6.79719028 L9.62321654,6.38666775 L9.21733473,6.07245915 C8.5679879,5.56976952 7.7753284,5.29115293 6.93642036,5.28563087 L6.91098485,5.28554717 Z"
                      id="\u5F62\u72B6\u7ED3\u5408"
                      transform="translate(7.996309, 7.999939) scale(-1, -1) translate(-7.996309, -7.999939) "></path>
                  </g>
                </g>
              </g>
            </g>
          </svg>
        </div>
        <div class="info flex flex-1 ml-4 flex-col">
          <div class="top flex justify-between flex-center flex-1">
            <a-space>
              <div class="name text-5 font-800">妞妞</div>
              <svg class="mt-0.5 cursor-pointer ml1" width="20px" height="20px" viewBox="0 0 16 14">
                <g id="\u9875\u9762-2" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
                  <g id="\u753B\u677F\u5907\u4EFD-21" transform="translate(-474.000000, -608.000000)" fill="#CCCCCC">
                    <g id="Rectangle-2\u5907\u4EFD-89" transform="translate(398.000000, 580.000000)">
                      <g id="\u7F16\u7EC4" transform="translate(76.000000, 21.600000)">
                        <g id="\u7F16\u7EC4" transform="translate(0.000000, 6.400000)">
                          <path
                            d="M12.5488957,14.2844713 L11.5010486,14.2844713 C11.1341596,14.280754 10.8398076,13.9883197 10.843536,13.6312425 C10.8398076,13.2741654 11.1341596,12.9817311 11.5010486,12.9780138 L12.5488957,12.9780138 C13.1929132,12.9707828 13.7094253,12.457622 13.7035882,11.8308133 L13.7035882,5.51659915 C13.7049584,5.07149643 13.4426881,4.66546656 13.0299588,4.47372986 L8.49973266,2.41098807 C8.19497588,2.2717625 7.84236314,2.2717625 7.53760636,2.41098807 L3.00725203,4.47372986 C2.59455747,4.66549483 2.33231941,5.07151473 2.33368895,5.51659915 L2.33368895,8.11331051 C2.33741739,8.47038769 2.04306536,8.76282195 1.67617635,8.76653928 C1.30928733,8.76282195 1.0149353,8.47038769 1.01862871,8.11331051 L1.01862871,5.51659915 C1.01573797,4.56462047 1.57664141,3.69619985 2.4593492,3.28605311 L6.98970297,1.22331132 C7.64157303,0.925562892 8.39577156,0.925562892 9.04764162,1.22331132 L13.5778672,3.28605311 C14.460609,3.69617215 15.0215439,4.56460257 15.0186287,5.51659915 L15.0186287,11.8308133 C15.0186287,13.1837748 13.9107309,14.2844713 12.5488957,14.2844713 Z"
                            id="\u8DEF\u5F84"></path>
                          <path
                            d="M1.56733162,10.2194036 C1.40127346,10.2195233 1.23544109,10.2313173 1.07112909,10.2546935 C1.02383678,10.4730961 1,10.6956916 1,10.9188916 C1,11.7700045 1.34739282,12.5862583 1.96575882,13.1880863 C2.58412481,13.7899143 3.42280952,14.1280178 4.29731162,14.1280178 C4.51607755,14.1280178 4.73430678,14.1069519 4.94880175,14.0650857 C4.97598308,13.8947261 4.98963678,13.7225811 4.98963678,13.5501797 C4.98963678,12.666803 4.6290758,11.8196066 3.98726883,11.1949647 C3.34546185,10.5703228 2.4749842,10.2194036 1.56733162,10.2194036 Z"
                            id="\u8DEF\u5F84"></path>
                          <path
                            d="M4.04965057,14.1112242 C4.36580361,14.1624804 4.68574686,14.1883875 5.00625618,14.1886844 C6.55014367,14.1886844 8.03079835,13.5917848 9.12249298,12.529291 C10.2141876,11.4667972 10.8274979,10.0257453 10.8274979,8.5231503 C10.8271446,8.25723104 10.8076999,7.99166078 10.7693057,7.72837983 C10.4531526,7.67712408 10.1332094,7.65121719 9.81270009,7.65092023 C8.26881275,7.65092023 6.78815822,8.24781981 5.69646369,9.3103135 C4.60476916,10.3728072 3.99145897,11.813859 3.99145897,13.3164538 C3.99181199,13.582373 4.01125654,13.8479433 4.04965057,14.1112242 Z"
                            id="\u8DEF\u5F84"></path>
                        </g>
                      </g>
                    </g>
                  </g>
                </g>
              </svg>
              <svg class="mt-0.5 cursor-pointer ml0.5" width="20px" height="20px" viewBox="0 0 16 14">
                <g id="\u9875\u9762-2" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
                  <g id="\u753B\u677F\u5907\u4EFD-21" transform="translate(-594.000000, -608.000000)">
                    <g id="\u7F16\u7EC4-11" transform="translate(518.000000, 310.000000)">
                      <g id="Rectangle-2\u5907\u4EFD-88" transform="translate(0.000000, 270.000000)">
                        <g id="\u7F16\u7EC4" transform="translate(76.000000, 21.600000)">
                          <g id="\u7F16\u7EC4" transform="translate(0.000000, 6.400000)">
                            <polygon id="\u77E9\u5F62" fill="#000000" fill-rule="nonzero" opacity="0"
                              points="0 0 16 0 16 16 8 16 0 16"></polygon>
                            <path
                              d="M1.49983336,11 C1.74529324,10.9999182 1.94950067,11.1767253 1.99191437,11.4099604 L2,11.4998334 L2,14 L4.5,14 C4.74545992,14 4.9496084,14.1768752 4.99194436,14.4101244 L5,14.5 C5,14.7454599 4.82312487,14.9496084 4.58987566,14.9919444 L4.5,15 L1.50100003,15 C1.25559799,15 1.05147725,14.8232051 1.00908211,14.5900195 L1.00100006,14.5001667 L1,11.5001667 C0.999908009,11.2240243 1.223691,11.0000921 1.49983336,11 Z M14.4988336,11 C14.7442935,10.9999183 14.9485009,11.1767254 14.9909146,11.4099605 L14.9990002,11.4998334 L15,14.4998334 C15.0000818,14.7453511 14.8231944,14.9495863 14.5898958,14.9919408 L14.5,15 L11.5,15 C11.2238576,15 11,14.7761424 11,14.5 C11,14.2545401 11.1768752,14.0503917 11.4101244,14.0080557 L11.5,14 L14,14 L13.9990003,11.5001667 C13.9989185,11.2547068 14.1757256,11.0504994 14.4089607,11.0080857 L14.4988336,11 Z M4.5,9 L11.5,9 L11.4931641,9.38828125 L11.4931641,9.38828125 L11.4769287,9.60498047 L11.4769287,9.60498047 L11.4453125,9.83125 C11.28125,10.75 10.625,11.8 8,11.8 C5.484375,11.8 4.77685547,10.8356771 4.5778656,9.94669189 L4.53663635,9.71717529 C4.53140259,9.67943522 4.5269165,9.64200846 4.52307129,9.60498047 L4.50683594,9.38828125 L4.50683594,9.38828125 L4.5,9 Z M11,5.5 C11.5522847,5.5 12,5.94771525 12,6.5 C12,7.05228475 11.5522847,7.5 11,7.5 C10.4477153,7.5 10,7.05228475 10,6.5 C10,5.94771525 10.4477153,5.5 11,5.5 Z M5,5.5 C5.55228475,5.5 6,5.94771525 6,6.5 C6,7.05228475 5.55228475,7.5 5,7.5 C4.44771525,7.5 4,7.05228475 4,6.5 C4,5.94771525 4.44771525,5.5 5,5.5 Z M14.5,1 C14.7455177,1 14.9496939,1.17695541 14.9919707,1.41026814 L15,1.50016663 L14.9990002,4.50016663 C14.9989082,4.77630898 14.774976,5.000092 14.4988336,5 C14.2533737,4.99991817 14.0492842,4.82297499 14.007026,4.58971169 L13.9990003,4.49983337 L14,2 L11.5,2 C11.2545401,2 11.0503916,1.82312484 11.0080557,1.58987563 L11,1.5 C11,1.25454011 11.1768752,1.05039163 11.4101244,1.00805567 L11.5,1 L14.5,1 Z M4.5,1 C4.77614235,1 5,1.22385763 5,1.5 C5,1.74545989 4.82312481,1.94960837 4.5898756,1.99194433 L4.5,2 L2,2 L2,4.50016667 C1.99991812,4.74562654 1.82297492,4.94971605 1.58971162,4.99197426 L1.49983331,5 C1.25437343,4.99991815 1.05028392,4.82297495 1.00802571,4.58971165 L1,4.49983333 L1.001,1.49983333 C1.0010818,1.25443131 1.17794474,1.05036951 1.41114451,1.0080521 L1.50099997,1 L4.5,1 Z"
                              id="\u5F62\u72B6" fill="#CCCCCC"></path>
                          </g>
                        </g>
                      </g>
                    </g>
                  </g>
                </g>
              </svg>
            </a-space>
            <a-space>
              <a-button>删除</a-button>
              <a-button>编辑</a-button>
              <a-button>未排课点名</a-button>
              <a-button>分配销售</a-button>
              <a-button>试听</a-button>
              <a-button type="primary">报名</a-button>
            </a-space>
          </div>
          <div class="bottom flex-1 flex flex-items-center mt-2">
            <div class="birthday flex-center">
              <svg width="20" height="20" viewBox="0 0 16 18">
                <g id="\u9875\u9762-2" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
                  <g id="\u753B\u677F\u5907\u4EFD-24" transform="translate(-1395.000000, -98.000000)">
                    <g id="\u7F16\u7EC4" transform="translate(1395.000000, 98.000000)">
                      <rect id="\u77E9\u5F62" fill="#000000" fill-rule="nonzero" opacity="0" x="0" y="0" width="16"
                        height="16"></rect>
                      <path
                        d="M14.5,9 L14.5,13.4615385 C14.5,14.3112073 13.6045695,15 12.5,15 L3.5,15 C2.3954305,15 1.5,14.3112073 1.5,13.4615385 L1.5,9 L14.5,9 Z"
                        id="\u8DEF\u5F84" fill="#FF6B6B" fill-rule="nonzero"></path>
                      <path
                        d="M8,3.5 C8.55228475,3.5 9,3.05228475 9,2.5 C9,1.5 7.5,1 7.5,1 C7.5,1 7,1.94771525 7,2.5 C7,3.05228475 7.44771525,3.5 8,3.5 Z"
                        id="\u692D\u5706\u5F62" fill="#FF6B6B"></path>
                      <path
                        d="M8,4 C11,4 11,5.8954305 11,7 L12.1363636,7 C13.3850074,7 14.4075122,7.81925966 14.4940653,8.85716817 L14.5,9 C14.5,9.27614237 14.2761424,9.5 14,9.5 C13.7238576,9.5 13.5,9.27614237 13.5,9 L13.5,9.5 C13.5,10.0522847 13.0522847,10.5 12.5,10.5 C11.9477153,10.5 11.5,10.0522847 11.5,9.5 L11.5,9 C11.5,9.27614237 11.2761424,9.5 11,9.5 C10.7238576,9.5 10.5,9.27614237 10.5,9 L10.5,9.5 C10.5,10.0522847 10.0522847,10.5 9.5,10.5 C8.94771525,10.5 8.5,10.0522847 8.5,9.5 L8.5,9 C8.5,9.27614237 8.27614237,9.5 8,9.5 C7.72385763,9.5 7.5,9.27614237 7.5,9 L7.5,9.5 C7.5,10.0522847 7.05228475,10.5 6.5,10.5 C5.94771525,10.5 5.5,10.0522847 5.5,9.5 L5.5,9 C5.5,9.27614237 5.27614237,9.5 5,9.5 C4.72385763,9.5 4.5,9.27614237 4.5,9 L4.5,9.5 C4.5,10.0522847 4.05228475,10.5 3.5,10.5 C2.94771525,10.5 2.5,10.0522847 2.5,9.5 L2.5,9 C2.5,9.27614237 2.27614237,9.5 2,9.5 C1.72385763,9.5 1.5,9.27614237 1.5,9 C1.5,7.8954305 2.55823605,7 3.86363636,7 L5,7 L5.0005144,6.80904291 C5.00925926,5.69067721 5.16666667,4 8,4 Z"
                        id="\u5F62\u72B6\u7ED3\u5408" fill="#FFC3C3"></path>
                    </g>
                  </g>
                </g>
              </svg>
              <span class="text-4 text-#222 ml-2">1个月（04-09）</span>
            </div>
            <span class="flex w-0.25 h-3.5 bg-#ccc mr-2.5 mr-2.5"></span>
            <div class="acount flex-center">
              <svg width="20" height="20" viewBox="0 0 18.4736842 12.4736842" style="margin-top: 1px;">
                <g id="\u9875\u9762-1" stroke="none" stroke-width="1" fill="none" fill-rule="evenodd">
                  <g id="\u5B66\u5458\u8BE6\u60C5" transform="translate(-300, -139)">
                    <g id="\u7F16\u7EC4-11\u5907\u4EFD" transform="translate(299, 138)">
                      <rect id="\u77E9\u5F62" x="0" y="0" width="20" height="14"></rect>
                      <rect id="\u77E9\u5F62" fill="#FF9292" x="1" y="1" width="15" height="12" rx="2"></rect>
                      <rect id="\u77E9\u5F62" fill="#FFDEDE" x="1" y="4" width="15" height="3"></rect>
                      <circle id="\u692D\u5706\u5F62\u5907\u4EFD-2" fill="#FFDD2F" cx="14.4736842" cy="8.47368421"
                        r="5">
                      </circle>
                      <path
                        d="M13.4393398,5.74867629 L14.5,6.80922969 L15.5606602,5.74867629 C15.7342265,5.57510994 16.0036509,5.55582479 16.1985191,5.69082084 L16.267767,5.74867629 C16.4630291,5.94393844 16.4630291,6.26052093 16.267767,6.45578308 L15.706,7.01622969 L16.5,7.01644325 C16.7761424,7.01644325 17,7.24030087 17,7.51644325 C17,7.79258562 16.7761424,8.01644325 16.5,8.01644325 L14.999,8.01622969 L14.999,9.01622969 L16.5,9.01644325 C16.7761424,9.01644325 17,9.24030087 17,9.51644325 C17,9.79258562 16.7761424,10.0164432 16.5,10.0164432 L14.999,10.0162297 L15,11.5164432 C15,11.7925856 14.7761424,12.0164432 14.5,12.0164432 C14.2238576,12.0164432 14,11.7925856 14,11.5164432 L13.999,10.0162297 L12.5,10.0164432 C12.2238576,10.0164432 12,9.79258562 12,9.51644325 C12,9.24030087 12.2238576,9.01644325 12.5,9.01644325 L13.999,9.01622969 L13.999,8.01622969 L12.5,8.01644325 C12.2238576,8.01644325 12,7.79258562 12,7.51644325 C12,7.24030087 12.2238576,7.01644325 12.5,7.01644325 L13.293,7.01622969 L12.732233,6.45578308 C12.5369709,6.26052093 12.5369709,5.94393844 12.732233,5.74867629 C12.9274952,5.55341415 13.2440777,5.55341415 13.4393398,5.74867629 Z"
                        id="\u5F62\u72B6\u7ED3\u5408" fill="#E7B000"></path>
                    </g>
                  </g>
                </g>
              </svg>
              <span class="price mx-2 text-4">0</span>
              <span class="text-#06f cursor-pointer text-3.5">储值
                <RightOutlined class="text-3" />
              </span>
            </div>
            <span class="flex w-0.25 h-3.5 bg-#ccc mr-2.5 mx-2.5"></span>
            <div class="phone">
              <span class="text-4">198****0917（妈妈）</span>
              <EyeInvisibleOutlined class=" cursor-pointer text-#06f text-4" />
            </div>
            <span class="flex w-0.25 h-3.5 bg-#ccc mr-2.5 mx-2.5"></span>
            <img width="18" height="18" src="https://pcsys.admin.ybc365.com//06365255-087c-423c-bf37-33a4ceab650b.png"
              alt="">
            <span class="ml-1 text-#888 text-3.5">0</span>
          </div>
        </div>
      </div>
      <div class="desc pt-4 bg-white px6 py3 pb0">
        <a-descriptions :column="4" size="small" :contentStyle="{ color: '#888' }">
          <a-descriptions-item label="销售员">张晨</a-descriptions-item>
          <a-descriptions-item label="班主任">陈瑞生</a-descriptions-item>
          <a-descriptions-item label="意向度">中</a-descriptions-item>
          <a-descriptions-item label="来源渠道">抖音短视频</a-descriptions-item>
          <a-descriptions-item label="跟进状态">跟进中</a-descriptions-item>
          <a-descriptions-item label="微信号">11150099858</a-descriptions-item>
          <a-descriptions-item label="年级">一年级</a-descriptions-item>
          <a-descriptions-item> <span class="text-#06f cursor-pointer">查看全部资料</span> </a-descriptions-item>
        </a-descriptions>
      </div>
      <div class="tabs">
        <a-tabs v-model:activeKey="activeKey" size="large" :tabBarStyle="{
          'border-radius': '0px', 'padding-left': '24px'
        }">
          <a-tab-pane key="0" tab="报读课程（5）">
            <register-for-courses></register-for-courses>
          </a-tab-pane>
          <a-tab-pane key="1" tab="上课记录">
            <class-record></class-record>
          </a-tab-pane>
          <a-tab-pane key="2" tab="订单记录">
            <order-record></order-record>
          </a-tab-pane>
          <a-tab-pane key="3" tab="试听记录">
            <try-listening-record></try-listening-record>
          </a-tab-pane>
          <a-tab-pane key="4" tab="跟进记录">
            <follow-up-record></follow-up-record>
          </a-tab-pane>
          <a-tab-pane key="5" tab="康复档案">
            3
          </a-tab-pane>

          <a-tab-pane key="6" tab="评估报告">
            3
          </a-tab-pane>
          <a-tab-pane key="7" tab="康复记录">
            3
          </a-tab-pane>
          <a-tab-pane key="8" tab="作业记录">
            3
          </a-tab-pane>
          <a-tab-pane key="9" tab="交互记录">
            3
          </a-tab-pane>
        </a-tabs>
      </div>
    </a-drawer>
  </div>
</template>

<script setup>
import { CloseOutlined, RightOutlined, EyeInvisibleOutlined } from '@ant-design/icons-vue';

const activeKey = ref('0');
const props = defineProps({
  open: {
    type: Boolean,
    default: false
  },
})
const emit = defineEmits(['update:open']);
// 处理双向绑定
const openDrawer = computed({
  get: () => props.open,
  set: (value) => emit('update:open', value)
});

// defineEmits(['update:open']);
</script>

<style lang="less" scoped>
/* 添加旋转动画 */
@keyframes icon-rotate {
  from {
    transform: rotate(0deg);
  }

  to {
    transform: rotate(180deg);
  }
}

.close-btn {
  &:hover {
    background: transparent;

    .close-icon {
      animation: icon-rotate 0.3s linear;
    }
  }
}

.tabs {
  width: 100%;
  border-radius: 10px;

  :deep(.ant-tabs-nav) {
    background: #fff;
    margin: 0;
  }



  :deep(.ant-tabs-ink-bar) {
    text-align: center;
    height: 12px !important;
    background: transparent;
    bottom: 0px !important;

    &::after {
      position: absolute;
      top: 0;
      left: calc(50% - 12px);
      width: 24px !important;
      height: 4px !important;
      border-radius: 2px;
      background-color: var(--pro-ant-color-primary);
      content: "";
    }
  }
}
</style>